Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ЗаказыПоставщикам
	Движения.ЗаказыПоставщикам.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ЗаказыПоставщикам.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Поставщик = Поставщик;
		Движение.Валюта = Валюта;
		Движение.Организация = Организация;
		Движение.Количество = ТекСтрокаТовары.Количество+1;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

КонецПроцедуры